Public Attributes | List of all members
API_AssemblySegmentCutData Struct Reference
Element Manager API
Represents a cut on segment. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_AssemblySegmentCutTypeID  | cutType
Type of cut. See API_AssemblySegmentCutTypeID.
double  | customAngle
The angle of cut if cutType is APIAssemblySegmentCut_Custom.
Detailed Description
Represents a cut on segment.
Member Data Documentation
◆ customAngle
 API_AssemblySegmentCutData::customAngle
The angle of cut if cutType is APIAssemblySegmentCut_Custom.
◆ cutType
 API_AssemblySegmentCutData::cutType
Type of cut. See API_AssemblySegmentCutTypeID.